/*
1. Стандартные потоки
Определить класс с именем ROUTE, содержащий следующие поля:
● название начального пункта маршрута;
● название конечного пункта маршрута;
● номер маршрута.
Определить методы доступа к этим полям и перегруженные операции
извлечения и вставки для объектов типа ROUTE.
Написать программу, выполняющую следующие действия:
● ввод с клавиатуры данных в массив, состоящий из восьми объектов
типа ROUTE; записи должны быть упорядочены по номерам
маршрутов;
● вывод на экран информации о маршрутах, которые начинаются или
кончаются в пункте, название которого введено с клавиатуры;
● если таких маршрутов нет, выдать на дисплей соответствующее
сообщение.
2. Файловые и строковые потоки
С использованием файловых и строковых потоков написать программу,
которая считывает текст из файла и выводит на экран только строки, не
содержащие двузначные числа.
*/
#include<iostream>
#include"Header.h"
#include<fstream>

using namespace std;

int main()
{
	system("chcp 1251");
	int choice = 0;

	do
	{
		system("cls");
		cout << "Âûáèðèòå çàäàíèå." << endl << "[0] Âûõîä èç ïðîãðàììû." << endl << "[1] Ñòàíäàðòíûå ïîòîêè (êëàññ Route)." << endl
			<< "[2] Ôàéëîâûå ïîòîêè (Ïðîãðàììà, âûâîäÿùàÿ òåêñò èç ôàéëà ñòðîêè íå ñîäåðæàùèå äâóçíà÷íûå ÷èñëà)." << endl;

		cin >> choice;
		switch (choice)
		{
		case 1://Çàäàíèå 1
		{
			try
			{
				int d;
				cout << "Ââåäèòå êîëè÷åñòâî ìàðøðóòîâ:";
				cin >> d;
				if (d < 1)
					throw d;
				ArrayOfRoute obg(d);
				obg.menu();
			}
			catch(int d)
			{
				cout << d << " Ìàðøðóòîâ íå ìîæåò áûòü ñîçäàíî!!!" << endl;
				system("pause");
				system("cls");
			}
			break;
		}
		case 2://Çàäàíèå 2
		{
			try
			{
				int flag = 0;
				string str;
				ifstream input;
				input.open("file.txt", std::ios::in);

				if (!input.is_open())
					throw input;
				
				while(!input.eof())
				{
					flag = 0;
					getline(input, str);

					if (str.size() < 4)
					{
						if (str.size() == 2)
						{
							if (((str[0] >= '0') && (str[0] <= '9')) && ((str[1] >= '0') && (str[1] <= '9')))
							{
								flag = 1;
							}
						}
						else
						{
							if (str.size() == 3)
							{
								if (((str[0] >= '0') && (str[0] <= '9')) && ((str[1] >= '0') && (str[1] <= '9')) && ((str[2] == ' ') || (str[2] == '-') || (str[2] == '+') || (str[2] == '/') || (str[2] == '*')))
								{
									flag = 1;
								}
							}
						}
					}
					else
					{
						if (((str[0] >= '0') && (str[0] <= '9')) && ((str[1] >= '0') && (str[1] <= '9')) && ((str[2] == ' ') || (str[2] == '-') || (str[2] == '+') || (str[2] == '/') || (str[2] == '*')))
						{
							flag = 1;
						}
						else
						{
							if (((str[str.size() - 2] >= '0') && (str[str.size() - 2] <= '9')) && ((str[str.size() - 1] >= '0') && (str[str.size() - 1] <= '9')) && ((str[str.size() - 3] == ' ') || (str[str.size() - 3] == '-') || (str[str.size() - 3] == '+') || (str[2] == '/') || (str[str.size() - 3] == '*')))
							{
								flag = 1;
							}
							else
							{
								for (int i = 1; i < str.size() - 3; i++)
								{

									if (((str[i] >= '0') && (str[i] <= '9')) && ((str[i + 1] >= '0') && (str[i + 1] <= '9')) && ((str[i + 2] == ' ') || (str[i + 2] == '-') || (str[i + 2] == '+') || (str[i + 2] == '/') || (str[i + 2] == '*')) && ((str[i - 1] == ' ') || (str[i - 1] == '-') || (str[i - 1] == '+') || (str[i - 1] == '/') || (str[i - 1] == '*')))
									{
										flag = 1;
										break;
									}

								}
							}
						}
					}
					if (flag == 0)
						cout << str << endl;

				}
				system("pause");
				input.close();
			}
			catch( ifstream &input)
			{
				cout << "Âûçâàíî èñêëþ÷åíèå, íå óäàëîñü îòêðûòü ôàéë" << endl;
				system("pause");
				system("cls");
			}

			break;
		}
		case 0: break;

		default:
			cout << "Íåâåðíî ââåäåíà êîìàíäà!" << endl;
			system("pause");
			system("cls");
		}

	} while (choice);

	return 0;
}
